#+title: Hugo を使う
#+author: Yoshio Shimano
# 出版した日付
#+date: 2019-03-31
# 更新日を自動的につける
#+hugo_auto_set_lastmod: t
# 見出しをレベル 6 まで出す
#+OPTIONS: H:6 num:t
#+STARTUP: indent
#+hugo_type: post
# 出力するディレクトリ
#+hugo_base_dir: ..
# 出版するファイル名
#+hugo_section: japanese/posts
#+OPTIONS: creator:nil author:t
#+OPTIONS: toc:nil
#+LANGUAGE: ja
# Hugo のタグ
#+hugo_tags: Hugo ox-hugo
# Hugo のカテゴリー
#+hugo_categories: Hugo

# ドキュメントクラスの指定
#+LATEX_CLASS: jsbook
# ドキュメントクラスのオプションの指定
# dvipdfmx ドライバはここで指定する
#+LATEX_CLASS_OPTIONS: [dvipdfmx,a4j,14pt,uplatex,openany]

# カスタムスタイルの読み込み
#+LATEX_HEADER: \usepackage{coco-jsbook}

# タイトルページで表示される情報
# ファイルのバージョン
+LATEX_HEADER: \FileVersion{1.0}
# コピーライト保有者
#+LATEX_HEADER: \CopyrightAuthor{島野善雄}
# コピーライトが発生した年
#+LATEX_HEADER: \CopyrightYear{2019}
# 機密レベル
#+LATEX_HEADER: \ConfidentialLevel{機密情報ではない}
# タイトルページに表示する画像
# #+LATEX_HEADER: \TitlePicture{images/story-zapfino-crop.pdf}

# はじまり
# テキストの色を少し白くする
#+LATEX: \color{Black!95!White}

** 例のブロック
:PROPERTIES:
:ID:       1f764e23-f725-4eb3-97f2-39fbfc4c0d2f
:END:

#+begin_src ruby
p "test"
#+end_src

#+RESULTS:
#+begin_example
test
#+end_example

